export const pixelStorage = [
  // 口
  [
    [
      [0, 3],
      [0, 4],
      [1, 4],
      [1, 3]
    ]
  ],
  // 一
  [
    [
      [0, 3],
      [0, 4],
      [0, 5],
      [0, 6]
    ],
    [
      [0, 3],
      [1, 3],
      [2, 3],
      [3, 3]
    ]
  ],
  // S
  [
    [
      [0, 3],
      [1, 3],
      [1, 4],
      [2, 4]
    ],
    [
      [1, 3],
      [1, 4],
      [0, 4],
      [0, 5]
    ]
  ],
  // Z
  [
    [
      [0, 3],
      [0, 4],
      [1, 4],
      [1, 5]
    ],
    [
      [1, 3],
      [2, 3],
      [0, 4],
      [1, 4]
    ]
  ],
  // 7
  [
    [
      [0, 3],
      [1, 3],
      [0, 4],
      [0, 5]
    ],
    [
      [0, 3],
      [1, 3],
      [2, 3],
      [2, 4]
    ],
    [
      [0, 3],
      [0, 4],
      [1, 4],
      [2, 4]
    ],
    [
      [1, 3],
      [1, 4],
      [1, 5],
      [0, 5]
    ]
  ],
  // L
  [
    [
      [0, 3],
      [1, 3],
      [1, 4],
      [1, 5]
    ],
    [
      [0, 3],
      [1, 3],
      [2, 3],
      [0, 4]
    ],
    [
      [0, 3],
      [0, 4],
      [0, 5],
      [1, 5]
    ],
    [
      [2, 3],
      [0, 4],
      [1, 4],
      [2, 4]
    ]
  ],
  // 丁
  [
    [
      [1, 3],
      [1, 4],
      [1, 5],
      [0, 4]
    ],
    [
      [0, 3],
      [1, 3],
      [2, 3],
      [1, 4]
    ],
    [
      [0, 3],
      [0, 4],
      [0, 5],
      [1, 4]
    ],
    [
      [0, 4],
      [1, 4],
      [2, 4],
      [1, 3]
    ]
  ],
  [
    [
      [0, 3]
    ]
  ]
];

export const W = 400;
export const H = 800;
export const VX = 20;
export const cachLen = VX * 4;
export const COLORS = ['#409EFF', '#67C23A', '#E6A23C', '#F56C6C'];

export function checkBound (list) {
  if (!list.length) return [H, W, 0, 0];

  let bx = [];
  let by = [];

  list.forEach(e => {
    bx.push(e.x);
    by.push(e.y);
  });

  let minx = Math.min(...bx);
  let miny = Math.min(...by);
  let maxx = Math.max(...bx);
  let maxy = Math.max(...by);

  return [miny, maxx + VX, maxy + VX, minx];
};
